In [8]:
import pandas as pd

data={'Name':['fazeem','benoy','jiji','prajith'],
       'age':[20,30,33,24],
       'address':['kochi','chennai','goa','amaravathi'],
       'salary':[2000,3000,2300,2500]}
df=pd.DataFrame(data)

df

      Name  age     address  salary
0   fazeem   20       kochi    2000
1    benoy   30     chennai    3000
2     jiji   33         goa    2300
3  prajith   24  amaravathi    2500

In [12]:
#pipe
result=(
    df[df['salary']>2000]
    .sort_values(by='age')
    .reset_index(drop=True)
    [['Name','age','address','salary']]
)
result

      Name  age     address  salary
0  prajith   24  amaravathi    2500
1    benoy   30     chennai    3000
2     jiji   33         goa    2300

In [16]:
import numpy as np

df['sqrt_salary'] = df['salary'].apply(np.sqrt)
df

      Name  age     address  salary  sqrt_salary
0   fazeem   20       kochi    2000    44.721360
1    benoy   30     chennai    3000    54.772256
2     jiji   33         goa    2300    47.958315
3  prajith   24  amaravathi    2500    50.000000

In [17]:
df.applymap(lambda x: len(str(x)))

C:\Users\muham\AppData\Local\Temp\ipykernel_10268\253312598.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: len(str(x)))

   Name  age  address  salary  sqrt_salary
0     6    2        5       4           18
1     5    2        7       4           18
2     4    2        3       4           18
3     7    2       10       4            4

In [18]:
df.age.apply(np.sum)

0    20
1    30
2    33
3    24
Name: age, dtype: int32